In [2]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('practise').getOrCreate()

In [73]:
# loading data file
df1 = spark.read.csv('../data/friends.csv',header=True,inferSchema=True)
df1.show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|    nitin|  25|      null| 45000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
|     null|  22|      null| 10000|
|   ashish|null|         4|  null|
+---------+----+----------+------+

In [74]:
df1.drop('name').show()

+----+----------+------+
| age|experience|salary|
+----+----------+------+
|  26|         4| 50000|
|  25|         3| 40000|
|  25|      null| 45000|
|  24|         1| 25000|
|  25|         2|  null|
|  27|         4| 35000|
|null|         1| 20000|
|  25|         2| 37000|
|  22|      null| 10000|
|null|         4|  null|
+----+----------+------+

In [61]:
df1.show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|    nitin|  25|      null| 45000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
|     null|  22|      null| 10000|
|   ashish|null|         4|  null|
+---------+----+----------+------+

In [62]:
# all the rows with null values get deleted from ataframe
df1.na.drop().show()

+-------+---+----------+------+
|   name|age|experience|salary|
+-------+---+----------+------+
| aditya| 26|         4| 50000|
|nainesh| 25|         3| 40000|
| snehal| 24|         1| 25000|
|prajwal| 27|         4| 35000|
|  viraj| 25|         2| 37000|
+-------+---+----------+------+

In [63]:
# how = any, all
# any dropsall the values, all drops only of all values in the row are null 
df1.na.drop(how='any').show()

+-------+---+----------+------+
|   name|age|experience|salary|
+-------+---+----------+------+
| aditya| 26|         4| 50000|
|nainesh| 25|         3| 40000|
| snehal| 24|         1| 25000|
|prajwal| 27|         4| 35000|
|  viraj| 25|         2| 37000|
+-------+---+----------+------+

In [64]:
df.na.drop(how='all').show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|    nitin|  25|      null| 45000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
|     null|  22|      null| 10000|
|   ashish|null|         4|  null|
+---------+----+----------+------+

In [65]:
df1.na.drop(how='all', thresh=2).show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|    nitin|  25|      null| 45000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
|     null|  22|      null| 10000|
|   ashish|null|         4|  null|
+---------+----+----------+------+

In [66]:
df1.na.drop(how='any', thresh=3).show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|    nitin|  25|      null| 45000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
+---------+----+----------+------+

In [67]:
df1.na.drop(how='any',subset=['age']).show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|   aditya| 26|         4| 50000|
|  nainesh| 25|         3| 40000|
|    nitin| 25|      null| 45000|
|   snehal| 24|         1| 25000|
|samruddhi| 25|         2|  null|
|  prajwal| 27|         4| 35000|
|    viraj| 25|         2| 37000|
|     null| 22|      null| 10000|
+---------+---+----------+------+

In [68]:
df1.na.drop(how='all',subset=['experience']).show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
|   ashish|null|         4|  null|
+---------+----+----------+------+

In [71]:
 # fill missing values
df1.na.fill('missing',['age']).show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|   aditya|  26|         4| 50000|
|  nainesh|  25|         3| 40000|
|    nitin|  25|      null| 45000|
|   snehal|  24|         1| 25000|
|samruddhi|  25|         2|  null|
|  prajwal|  27|         4| 35000|
|   sanket|null|         1| 20000|
|    viraj|  25|         2| 37000|
|     null|  22|      null| 10000|
|   ashish|null|         4|  null|
+---------+----+----------+------+